Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s3.aws_s3_bucket.b must be replaced
-/+ resource "aws_s3_bucket" "b" {
      + acceleration_status         = (known after apply)
        acl                         = "private"
      ~ arn                         = "arn:aws:s3:::sdfsdf222sfsdf111-sdfgdfgteraa" -> (known after apply)
      ~ bucket                      = "sdfsdf222sfsdf111-sdfgdfgteraa" -> "sdfsdf222sfsdf111-sdfgdfgtqqeraa" # forces replacement
      ~ bucket_domain_name          = "sdfsdf222sfsdf111-sdfgdfgteraa.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "sdfsdf222sfsdf111-sdfgdfgteraa.s3.eu-west-3.amazonaws.com" -> (known after apply)
        force_destroy               = false
      ~ hosted_zone_id              = "Z3R1K369G5AVDG" -> (known after apply)
      ~ id                          = "sdfsdf222sfsdf111-sdfgdfgteraa" -> (known after apply)
      ~ region                      = "eu-west-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "Dev"
            "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://54.144.165.7/lock?id=OuFinx%252Fterratest%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
